[{
  "title": "Pharmacy Supervisor - Drug Distribution - Brockville General Hospital",
  "company": "Kingston General Hospital – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1219&ao=4127&s=58&guid=00000163a84626c1b22089791b1ecda6&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_259f4e11&cb=1527536560201&jobListingId=2770952869",
  "img": "https://media.glassdoor.com/sqlm/101113/kingston-general-hospital-squarelogo.png",
  "description": "Applications will be accepted until 11:59 pm on 2018 May 18\n\nTitle: Pharmacy Supervisor, Drug Distribution - Brockville General Hospital\n\nDepartment: Pharmacy Services\nPosition Number: 50062633\nHours of Work: Temporary, Full-Time Position; Days (1 year)\nSalary: MSII ($70,559.58 - $86,239.34 per annum)\nUnion: Non-Union\n\nLocation: Brockville General Hospital Site\n\nDESCRIPTION\nReporting to the Pharmacy Manager, Operations, Systems and Integration, the Pharmacy Supervisor, Drug Distribution at Brockville General Hospital (BGH):\n\nDirectly supervises Pharmacy technician personnel, manages the Pharmacy technician schedules and is accountable for the training and certification of the Pharmacy technicians in assigned areas of practice.\n\nSupports the Pharmacy Manager, Operations, Systems and Integration with the coordination of daily activities supporting BGH Hospital drug distribution system in compliance with the National Association of Pharmacy Regulatory Authorities (NAPRA) Model Standards of Practice for Canadian Pharmacists, the Ontario College of Pharmacists Practice standards, the Hospital Administrative policies for managing pharmaceuticals and the standard operating procedures of the Department of Pharmacy Services.\n\nUnderstands and is familiar with all pertinent BGH and KHSC policies and procedures including those relating to workplace conduct. Complies with the BGH and KHSC Commitment to uphold the Workplace Conduct and Reporting of Inappropriate Conduct policy and behaves in a manner that is consistent with the guiding principles and expectations\n\nPRIMARY RESPONSIBILITES & DUTIES:\nWorks collaboratively with the Pharmacy Manager, Operations, Systems and Integration and assumes supervisory role of the BGH Pharmacy Dispensary to support the delivery of quality drug distribution services in the Hospital.\nResponsible for the strict adherence of the Pharmacy technicians working in the BGH Pharmacy to the National Association of Pharmacy Regulatory Authorities (NAPRA) Model Standards of Practice for Canadian Pharmacy Technicians, the Ontario College of pharmacists Code of Ethics and the Pharmacy Services standard operating procedures.\nSupervises and approves daily Pharmacy technician assignments and makes changes to staffing levels.\nSupports the pharmacy Manager, Operations, Systems and Integration with the management of the Pharmacy technicians:\nParticipates in the recruitment, hiring and discipline of Pharmacy technicians\nManages staff orientation and training\nManages the Pharmacy technician continuing education and training programs\nCompletes performance and development plans for Pharmacy technicians\nApproves and posts the working schedule.\nApproves vacation, lieu time and overtime.\nCoordinates training schedules of the Pharmacy technicians, assignment of trainers/preceptors and assesses competencies prior to assignment in a new area of practice.\nAccountable for the annual certification and recertification of the Pharmacy technicians in applicable areas of practice and will report to the Manager and/or Director non compliance which could result in employment suspension\nFormulates agenda for the monthly Pharmacy technician meeting and the weekly Sharing/Huddles meetings based off of operational updates.\nInvestigates staff complaints and represents the Pharmacy Management team in Labour Relations meetings and staff grievances.\nInvestigates medication incidents and patient and family complaints related to drug distribution.\nDevelops and reviews standard operating procedures and standard Pharmacy technician work assignment for activities related to the procurement, storage, packaging, compounding, preparation and dispensing of drugs in compliance with the Ontario College of Pharmacists inspection criteria and Canadian Hospital Pharmacy professional and accreditation standards.\nConducts quarterly safety inspections of the main Dispensary and ensures the work space is clean, orderly and safe for staff to work.\nParticipates in the Pharmacy Department annual tactics and strategic goals in alignment with the Hospital strategic plan.\nTracks outcome indicators to assess the quality and safety of the drug distribution system\nSupports the implementation of new equipment, technology or processes related to improvement in the drug distribution system.\nManages record keeping of drug purchases and dispensing records.\nCoordinates and oversees Pharmacy technician student placement program.\nMember of the BGH Medication Safety Committee.\n*NOTE: The above duties are representative but are not to be construed as all-inclusive.\n\nQUALIFICATIONS:\nRegistration as Regulated Pharmacy technician with the Ontario College of Pharmacists\nMinimum of five years hospital pharmacy experience.\nMinimum of two years Pharmacy technician leadership experience preferred\nExcellent verbal and written communication\nDemonstrated interpersonal, communication, presentation skills and conflict resolution management\nAbility to develop, plan and implement short and long-range goals\nExcellent interpersonal skills including:\nteaching and mentoring\nmotivation and leadership\nProven experience organizing and managing teams\nDemonstrated conflict resolution skills and ability to handle sensitive staff issues.\nProblem analysis and solving skills\nProficient computer skills (MS Office, data management)\nDemonstrated conflict resolution skills and ability to handle sensitive staff issues.\nPharmacy Systems (QuadraMed, Omnicell) preferred.\nWorking knowledge of Occupational Health & Safety guidelines, Collective Agreement administration, Human Resources policies and procedures preferred\nDemonstrated ability to attend work on a regular basis\nSatisfactory criminal reference check required.\nPHYSICAL REQUIREMENTS:\n\nThe applicant must be able to meet the physical demands of this position.",
  "type": "Full Time",
  "sectors": ["Management", "Computer & IT"],
  "skills": ["Ability", "Admin", "Administrative", "Agreement", "App", "Application", "Applications", "Appro", "Association", "Author", "CAT", "Canadian", "Code", "Code of Ethics", "Collect", "College", "Comm", "Comp", "Coordinate", "DES", "Department", "Develops", "Direct", "Director", "Distribution", "Drug Distribution", "EME", "ENT", "ESP", "Ethics", "Excel", "Excellent", "FICA", "Form", "Formulate", "Full", "Gen", "General", "Health", "Health & Safety", "Hospital Pharmacy", "Hour", "Hours", "Human Resources", "ICA", "IMA", "IPT", "Int", "Integration", "LIF", "Location", "MAR", "Management", "Manages", "NAP", "NSI", "National", "ONS", "Occupation", "Occupational Health", "Office", "Omnicell", "Ontario", "Ope", "Opera", "Operation", "Operations", "PHY", "PON", "PRA", "Part", "Pharm", "Pharmacists", "Pharmacy", "Pharmacy Technicians", "Pro", "Quad", "REM", "RESP", "RIM", "RIP", "Registration", "Regulatory", "Relation", "Reporting", "Res", "Resources", "Responsible", "SCR", "SIC", "SII", "Safe", "Safety", "Safety Committee", "Salary", "Services", "Stand", "Supports", "Syst", "System", "Systems", "TES", "Tempo", "Time", "Trac", "Tracks", "Union"],
  "similarity": 7.357142857142857
}, {
  "title": "Intermediate Operations Engineer",
  "company": "Cardinal Health – Gananoque",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1704&ao=133764&s=58&guid=00000163a84da015a4690709241d7b75&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_3cecd6d8&cb=1527537049967&jobListingId=2790378965",
  "img": "https://media.glassdoor.com/sqlm/1227/cardinal-health-squarelogo-1391194404797.png",
  "description": "Cardinal Health-Gananoque manufactures many life impacting medical devices that help our customers thrive in a changing world.\nWe are your humble partners, striving each day to make healthcare more efficient, providers more effective and our patients as healthy as possible. We are more than 500 employees with 119 years of Canadian history, a deep understanding of the medical devices we manufacture every day and a passion for innovation. We apply our industry experience and expertise to help you reduce the total cost of healthcare so you can focus on improving the lives of our patients. We utilize our scale and knowledge to create and provide solutions across our entire product portfolio—not just at certain points, but from start to finish; not only today, but well into the future. We’re accountable for our results and proud of the work we perform.\nCardinal Health is currently seeking an Intermediate Operations Manager to join the team on a full time permanent basis in our Gananoque, Ontario, Manufacturing Facility.\n\nAs an Operations Engineer you will be responsible for providing technical leadership and expertise to the entire Gananoque site, yet focused on operations & maintenance for the specification, design, installation, start-up, and sustenance of facility processes and support equipment. You will oversee multiple projects of various scale and provide support to project teams, particularly as it applies to production processes and support equipment in support of an FDA regulated 24/7 manufacturing environment. You will be responsible for using technical and lean manufacturing tools to complete a variety of plant continuous improvement projects. Projects may already be in a variety of different statuses from non-existent, to concept known, to ready to implement. Drive activities which support corporate safety & quality programs.\nMAJOR RESPONSIBILITIES:\nAs a technical leader and a professional representative of the management team your daily actions are expected to be carried out as a role model in exhibiting such behaviors and fostering the development of our corporate values: accountable, tenacious, inventive, adaptable, enthusiastic, competitive, open, direct, respectful, trusted and inclusive.\nManage multiple projects of various scale associated with manufacturing/industrial design, new facility layouts, facility upgrades, and design and installation of new production and material handling equipment, process improvements, cost containments, yield improvements, and scrap reduction.\nUtilizes corporate capital processes to support project execution in a financially responsible fashion, in collaboration with Senior Leadership.\nImplement technology advancements and best practices into operations.\nSupport operations & maintenance, project teams by providing direct technical expertise during trouble shooting, optimization, center lining and maintenance activities.\nResponsible for seeing that all related activities are performed in a manner that complies with the Cardinal Quality Management, Safety or Environmental Management Systems, and all governing regulatory bodies.\nInterpret internal and/or external business opportunities and recommends solutions. Solves complex problems and takes a broad perspective to identify solutions. Works independently with guidance in only the most complex situations.\nApply statistical methods including DOE, SPC, Flow Charting, and FMEA tools as part of routine process analysis. Support for manufacturing issues, CAPA’s, SCARS and audits.\nDevelop, execute and document protocols and reports for test methods, process studies and process validations, maintain accurate and compliant documentation to meet company and regulatory expectations.\nTHE IDEAL CANDIDATE WILL HAVE:\nUndergraduate Degree in Engineering\nMinimum of 4 to 14 years industrial/manufacturing engineering experience\nIndustrial/manufacturing process and/or packaging automation experience\nProject Management, Lean Manufacturing and Six Sigma certification/experience an asset\nExperience in a regulatory environment is an asset (cGMPs)\nWorking knowledge of Quality Management, Auditing, Engineering, and ISO\nSound analytical thinking, planning, prioritization and execution skills\nAbility to lead and manage cross-functional teams\nAn adaptable, inclusive, respectful and value-driven professional (PEO Licensed or eligible)\nCardinal Health is committed to employment equity and encourages applications from women, visible minorities, Aboriginal peoples and persons with disabilities. Cardinal Health is committed to accommodating applicants with disabilities throughout the hiring process, in accordance with the Accessibility for Ontarians with Disabilities Act (AODA). Our Human Resources team is responsible for working with applicants requesting an accommodation at any stage of the hiring process.\n\nApply",
  "type": "Full Time",
  "sectors": [],
  "skills": ["AOD", "AODA", "APA", "ARS", "Ability", "Aboriginal", "Access", "Accessibility", "App", "Apply", "Audi", "Auditing", "CAP", "Canadian", "Chart", "DAT", "DEA", "Disabilities", "Drive", "EAL", "ESP", "Engineering", "Env", "Environmental Management Systems", "Exp", "FME", "Flow", "GMP", "GMPs", "Health", "Human Resources", "IDA", "IDEA", "IDEAL", "ISO", "Int", "Intermediate", "Interpret", "Leadership", "Lean Manufacturing", "MEA", "Management", "Management System", "Manufacturing", "NSI", "ONS", "Ontario", "Ope", "Opera", "Operation", "Operations", "PON", "Pro", "Project Management", "Quality Management", "RESP", "Res", "Resources", "Responsible", "SCA", "SCAR", "Safe", "Safety", "Sigma", "Six Sigma", "Solve", "Sound", "Syst", "System", "Systems", "Undergraduate"],
  "similarity": 7.2
}, {
  "title": "Director - Facilities Management",
  "company": "Kingston General Hospital – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1412&ao=4127&s=58&guid=00000163a849440e9ef5c4089038575b&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_2877e895&cb=1527536764236&jobListingId=2721272023",
  "img": "https://media.glassdoor.com/sqlm/101113/kingston-general-hospital-squarelogo.png",
  "description": "Applications will be accepted until 11:59 pm on April 11, 2018\n\nTITLE: Director – Facilities Management\n\nPOSITION #: 50015423\n\nHOURS OF WORK: Full-Time Position, Days\n\nSALARY: MSV ($116,300.93 - $142,145.64)\n\nUNION: Non-Union\n\nPOSITION SUMMARY:\n\nThe Director, Facilities Management provides strategic leadership and oversight in maintenance, plant operations and building systems. Responsible for managing the operation and maintenance of the hospitals facilities, the Director leads the planning, implementation and coordination of, building repair, maintenance assignments, and overall energy efficiency.\n\nCritical to ensuring the continuation of clinical operations at Kingston Health Sciences Centre, the Director ensures hospital operations maintain cost effectiveness, environmental sustainability, service quality, and business development, while ensuring compliance with appropriate legislation.\n\nWithin this role the Director is accountable for contributing to the delivery of the KHSC strategy. As an employee, one must demonstrate an awareness of and be responsible for actively promoting and supporting patient and family centered engagement and care in all we do.\n\nStrategic Program Development\nLead strategic and operational planning for Facilities, to achieve business goals by fostering innovation, establishing standardization across sites, prioritizing facilities initiatives, and coordinating the evaluation, deployment, and management of current and future Facilities systems and resources across KHSC.\nProvide leadership to all functions in the portfolio, planning, implementing assessing, evaluating and where appropriate modifying and improving service delivery in a manner that is consistent and congruent with the mission and vision of KHSC.\nInvolves organization and provision of professional input within engineering designation in accordance with the philosophy, objectives and policies of the organization and programs.\nLead the strategic and tactical project planning and maintenance activities related to building systems, preventive maintenance, day-to-day operational processes, environmentally positive processes and energy projects.\nDevelops strong working relationship with the Director of Capital Planning and Redevelopment and Capital Projects team to ensure effective coordination and clinical/business continuity while major projects are underway at both hospital sites.\nKeeps abreast and ensures on-going compliance to all legislative and regulated acts and policies pertaining to the portfolio\nLead the development and execution of a Corporate Operational Energy and Environmental Sustainability Management Program.\nLead the implementation of Energy Conservation projects to drive operational efficiencies\nLead energy and utility contract management\nDevelop strategies and operating plans for the implementation of approved infrastructure projects by providing recommendations for the prioritization and planning of projects\nOperational Leadership\nOversee repair work, preventative maintenance of existing buildings, grounds and utility systems at the hospital’s multi-site facilities, while ensuring the continuance of critical clinical operations\nManage the delivery, schedule, budget and quality of approved infrastructure projects, including the development and Implementation of facility improvement plans including small-medium sized infrastructure.\nReview, provide input into and approve project management plans (schedules) and allocates resources appropriately to ensure agreed upon milestones are achieved.\nManage project contractors to ensure that all work is carried out in accordance with tender awards and applicable codes, regulations, policies, standards and guidelines.\nSchedule and co-ordinate projects to maintain or enhance utility services to the Hospital.\nEnsure the provision of continuous services to the Hospital to include HVAC, water systems, electrical services, fire alarm and firefighting systems, and auxiliary systems.\nReceive, prioritize, and coordinate the completion of maintenance work requisitions from all departments to ensure services are satisfactorily supplied to all areas of the Hospital.\nEvaluate the continued use and life expectancy of existing buildings and systems.\nLead, assist, coordinate and implement the delivery of maintenance and repair programs, ensuring program objectives are achieved and resources utilized effectively.\nDevelop, coordinate and implement a preventative maintenance program. Conduct thorough assessments of buildings, grounds and other infrastructure to develop and present a comprehensive long term plan for addressing corrective and preventative maintenance requirements for all campuses in order to provide a safe, high quality, sustainable environment for patients and staff.\nManage and report on emergency maintenance response and actions in order to keep the facilities safe and functional.\nLiaise with internal hospital stakeholders, contractors and consultants to provide information regarding maintenance, repair, construction and renovations to resolve program and service delivery issues.\nManage escalated complaints.\nCorporate Leadership:\nLead interdisciplinary teams of professionals: developing/ exploring service improvement initiatives and maintaining fiduciary control and accountability.\nDevelop policies and procedures for the portfolio that support the strategic directions and adhere to the principles of Continuous Quality Improvement\nCollaborate and maintains effective communications with peers to ensure portfolio operations adhere to corporate standards\nParticipate in meetings and serves on committees as required\nProgram Evaluation:\nMeasure and analyzes program performance against accepted internal and external benchmarks and standards, including legislation, and adjusting program operations as required to maximize operations.\nEnsure review/evaluation systems are maintained and improved by reviewing service quality indicators, performance standard variances, service utilization and conducting risk analysis to ensure exposure prevention/risk minimization\nDevelop and establish cost reduction measures wherever possible with consideration to service impact\nFinancial Planning and Control\nPlan and forecast utility annual budget, performing investigation into energy improvement initiatives, ascertaining the viability of energy improvement projects.\nReview and analyzes reports from finance, follows up on any discrepancies and takes appropriate corrective action, ensuring efficiencies are maximized, investigating alternative measures to reduce costs.\nPrepare tender for maintenance contract, review, make recommendations. Review contracts to ensure quality, effectiveness, value and competiveness\nProvides statistical trend analysis.\nStaff Leadership\nCreate management accountability systems, which will communicate clear expectations to staff through the collaborative establishment of goals and objectives for individual portfolio staff\nPromote learning and development opportunities and the sharing of best practices\nManage performance of direct reports, including ongoing coaching, mentoring, role clarity, counseling and/or disciplinary action, involving other relevant stakeholders as appropriate (e.g. Human Resources, Quality & Risk Management)\nEnsure conflict and other labour relations issues, including grievance resolution, are resolved in a timely manner working through formal complaint/dispute resolution processes and ensuring the provisions of the applicable Collective Agreements are followed\nFoster collaborative working relationships among portfolio management and other corporate/support services/departments\nNOTE: The above duties are representative but are not to be construed as all-inclusive.\n\nQualifications:\nDegree in Engineering (Civil, Mechanical, or Electrical) required\nDegree in Business Administration, an asset\nMembership in good standing with Professional Engineers of Ontario preferred\nMinimum ten (10) years of progressive management experience in one or more of the areas within the portfolio, preferably in a hospital setting with complex plant systems\nMinimum five (5) years of experience in Facilities Engineering, preferably in an acute care academic teaching hospital, an asset\nEquivalent experience in the construction industry may be considered\nExperience working in a complex, dynamic, high demand work environment\nDemonstrated knowledge of provincial and federal regulatory agencies relating to hospital facility maintenance and construction\nAdvanced level proficiency using word processing, communications/scheduling and spreadsheet applications, Microsoft Windows Office suite (including Outlook, Word and Excel) required\nDemonstrated effective business acumen and experience with and understanding of strategic and business planning methods, tools and processes in providing efficient plant operations and its associated services\nDemonstrated project management experience including effectiveness with concurrently organizing, planning and coordinating operational initiatives with multiple project activities\nDemonstrated effectiveness in budget management and accountability\nProven knowledge of provincial and federal legislation and regulatory agencies relating to hospital facility maintenance and construction\nDemonstrated commitment to continued learning and effectiveness in promoting the value of learning and acquiring new information and skills to staff\nExcellent interpersonal, written and verbal communication skills including, ability to demonstrate tact and diplomacy with varied groups of stakeholders\nHighly developed and effective presentation skills including the ability to present and discuss complex information in a way that establishes rapport, persuades others and gains understanding\nStrong ability to lead and influence a diverse team in the context of major change, while maintaining group cohesiveness, motivation, commitment and providing ongoing excellent service\nAbility to manage, motivate and mentor multi-disciplinary teams of professional staff, and support staff, in a fast paced environment\nAbility to analyze data/results, conduct research, interpret and apply legislation related to facility operations, and lead improvements/projects/change involving multiple stakeholders.\nProven effectiveness in promoting compliance with professional and ethical practices, accreditation standards, and applicable legislation\nBroad understanding and commitment to health and safety policies, procedures and applicable legislation\nProfessional work attitude and behaviours in interaction with internal and external contacts\nSatisfactory CPIC with vulnerable sector search",
  "type": "Full Time",
  "sectors": ["Management", "Computer & IT"],
  "skills": ["Ability", "Admin", "Administration", "Adva", "Advance", "Advanced", "Agreement", "App", "Application", "Applications", "Bus", "Business", "Business Administration", "CPI", "CPIC", "Capital", "Capital Projects", "Collect", "Collective Agreements", "Conservation", "Cont", "Cor", "Create", "Crit", "Critical", "Develops", "Direct", "Director", "Energy", "Energy Conservation", "Engineering", "Engineers", "Env", "Evaluation", "Excel", "Excellent", "Exp", "Facilities Engineering", "Facilities Management", "Financial", "Financial Planning", "Foster", "Full", "HVAC", "Health", "Health Sciences", "High", "Human Resources", "Improvement", "LAR", "Leadership", "Liaise", "MAR", "Management", "Mechanica", "Mechanical", "Membership", "Micro", "Microsoft", "NIO", "OSI", "Office", "Ontario", "Ope", "Opera", "Operation", "Operational", "Outlook", "PIC", "POS", "Part", "Plan", "Planning", "Pro", "Profession", "Professional", "Program Development", "Program Evaluation", "Prom", "Promo", "Provide", "Qualification", "Quality Improvement", "Receive", "Redevelopment", "Res", "Resources", "Responsible", "Review", "Risk", "Risk Management", "SIT", "Schedule", "Science", "Strat", "Strategic", "Strategic Program Development", "Strong", "Sustain", "Sustainability", "Sustainability Management", "TLE", "Time", "URS", "Union", "Wind", "Window", "Windows", "Wit", "Word"],
  "similarity": 7.133333333333334
}, {
  "title": "Project Manager",
  "company": "iStorm – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=930&ao=4120&s=58&guid=00000163a84158ef8f60c0ddcd7f4994&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_10eaa419&cb=1527536245294&jobListingId=2593140232",
  "img": "https://media.glassdoor.com/sqlm/344877/istorm-squarelogo-1499684796493.png",
  "description": "Project Manager\nKingston\nPosted by: iSTORM New Media Inc.\nClosing Date: N/A\nRate of Pay\nRate of Pay:\n\nSalary\nPositions Available\nPositions Available:\n\n1\nType\nType:\n\nFull Time\nDuration\nDuration:\n\nPermanent\nAvg. Hours/Week\nAvg. Hours/Week:\n\n40\nSchedule\nSchedule:\n\nDays\nEducation\nEducation:\n\nCollege, University\n\nYou could be perfect for this job if you are confident in planning, initiating, and managing information technology (IT) projects. Lead and guide the work of technical staff. Serve as liaison between business and technical aspects of projects. Plan project stages and assess business implications for each stage. Monitor progress to assure deadlines, standards, and cost targets are met.\n\nApply for this job!\n\nWhat will you do:\nIdentify need for initial or supplemental project resources.\nNegotiate with project stakeholders or suppliers to obtain resources or materials.\nManage project execution to ensure adherence to budget, schedule, and scope.\nInitiate, review, or approve modifications to project plans.\nConfer with project personnel to identify and resolve problems.\n\nTools / Technologies:\nProject management software: Forum One Communications ProjectSpaces, OfficeWork Software TurboProject, MinuteMan Systems MinuteMan Project Management Software, Microsoft SharePoint, Countersoft Gemini\nDevelopment environment software: pm ase QuickBuild, Apache Gump, Adobe Systems Adobe ActionScript, Oracle Java 2 Platform Enterprise Edition J2EE, Apache Maven\nData base user interface and query software: Hewlett Packard HP Project Portfolio Management Solution, Planisware, Structured query language SQL, Objective Decision Contactizer Pro, Microsoft SQL Server\nWeb platform development software: Enterprise JavaBeans, JavaScript, Extensible HyperText Markup Language XHTML, Spring Framework, Ext JS\nEnterprise resource planning ERP software: Microsoft Dynamics, NetSuite ERP, Vitria M3O Operational Intelligence, Oracle PeopleSoft, Oracle JD Edwards EnterpriseOne\n\nPerks & Benefits\nMedical, prescription, dental, and vision plans\nLong term disability insurance\nTravel Accident Insurance\nDeath benefits\n\nFlexible work hours\n5 Day work weeks\nTerrific work environment\nCasual dress code\n\nChristmas gifts for employee children\nCompany paid week off for Christmas",
  "type": "Full Time",
  "sectors": ["Management"],
  "skills": ["Accident", "Accident Insurance", "Action", "ActionScript", "Adobe", "Apache", "App", "Apply", "Beans", "Casual", "Christmas", "Closing", "College", "Comm", "Communication", "Communications", "Comp", "Company", "Conf", "Cont", "Contact", "Counters", "Data", "Date", "Death", "Dec", "Decision", "Dyna", "Dynamic", "Dynamics", "Education", "EnterpriseOne", "Ext", "Ext JS", "Flex", "Flexi", "Flexible", "Frame", "Framework", "Full", "Gemini", "HTML", "Hour", "Hours", "Hype", "Hyper", "Identify", "Insurance", "Int", "Intel", "Intelligence", "JD Edwards", "Java", "JavaBeans", "JavaScript", "Language", "Management", "Management Software", "Mark", "Maven", "Media", "Medical", "Micro", "Microsoft", "Microsoft Dynamics", "Microsoft SQL Server", "Mon", "Monit", "N/A", "NetSuite", "New Media", "Office", "Ope", "Opera", "Operation", "Operational", "Operational Intelligence", "Oracle", "Pack", "Pay", "People", "PeopleSoft", "Plan", "Point", "Port", "Portfolio", "Portfolio Management", "Positions", "Pro", "Project Management", "Project Management Software", "Project Portfolio Management", "Quick", "Rate", "SQL", "SQL Server", "Salary", "Schedule", "Server", "SharePoint", "Software", "Solution", "Spa", "Space", "Spaces", "Spring", "Spring Framework", "Structure", "Structured", "Suite", "Syst", "System", "Systems", "Techno", "Technologie", "Text", "Time", "Tools", "Travel", "Turbo", "Type", "Vitria", "Web", "XHTML"],
  "similarity": 7.133333333333334
}, {
  "title": "Public Health Promoter- Reproductive and Child Health- Full Time",
  "company": "KFL&A Public Health – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=101&ao=352758&s=58&guid=00000163a835bd228eeae2c97320f8db&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&aa=1&ea=1&cs=1_cc7e7c85&cb=1527535484636&jobListingId=2788281669",
  "img": "https://media.glassdoor.com/sqlm/480576/kfl-and-a-public-health-squarelogo-1527133005929.png",
  "description": "KFL&A Public Health is a local public health agency with over 200 staff and 150 volunteers who deliver public health programs and services to the people of the KFL&A area. The Family Health Division has an immediate opening for a Public Health Promoter, Reproductive and Child Health.\nThe Public Health Promoter assess the need for health promotion, plans, implements and evaluates comprehensive health promotion strategies, and provides direct health promotion services in accordance with the Ontario Public Health Standards.\nThe successful candidate will have a Bachelor's degree in Health Promotion, Health Education or equivalent. Experience in health promotion preferred.\nKFL&A Public Health is committed to providing staff with a healthy work environment. Continuing education and professional development opportunities; flexibility in work hours; family-friendly policies; strong community and clinical leadership and support and an open-minded, caring, supportive environment, all play an integral role in employee retention.\nIf you are interested in this exciting opportunity, please apply to: Human Resources, KFL&A Public Health: hr@kflaph.ca by June 1, 2018.\nKFL&A Public Health welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.\nWe thank all those who take the time to apply, but only those chosen for an interview will be contacted.",
  "type": "Full Time",
  "sectors": ["Healthcare", "Personal Care & Services"],
  "skills": ["Accommodation", "Child Health", "Cont", "Division", "Education", "Exp", "Family", "Full", "Health", "Health Education", "Health Promotion", "Human Resources", "L&A", "Ontario", "Pro", "Prom", "Promo", "Public Health", "Repro", "Reproductive", "Res", "Resources", "Stand", "Time"],
  "similarity": 7.0
}, {
  "title": "Registered Practical Nurse (RPN)",
  "company": "Saint Elizabeth Health Care – Gananoque",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1721&ao=3949&s=58&guid=00000163a84da015a4690709241d7b75&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_3d3a54a1&cb=1527537050063&jobListingId=2675417699",
  "img": "https://media.glassdoor.com/sqlm/341990/saint-elizabeth-health-care-squarelogo-1470248466316.png",
  "description": "About Saint Elizabeth\nSaint Elizabeth is a national health care provider that has been opening the door to new possibilities and experiences for more than a century. Recognized as Canada’s largest social enterprise, we employ 8,000 people and visit 18,000 clients every day. Through the Saint Elizabeth Research Centre, Health Career Colleges, the Saint Elizabeth Foundation and our leadership in person and family centered care, we are helping to make the future of health care brighter and stronger. Saint Elizabeth Health Care was awarded the Canada Order of Excellence in 2015.\n\nWe are currently hiring Registered Practical Nurse (RPN) to work in Gananoque and surrounding area's.\n\nYou will use evidence-informed nursing knowledge, skill and judgment and work within the RPN scope of practice to provide holistic nursing care to meet the physical, safety, emotional and spiritual needs of clients and their families in their homes and communities.\n\nThere are many reasons why you will want to bring your talent to our team:\nAs an RPN you will be part of a distinguished Canadian, not-for-profit organization with a century of experience\nAs an RPN you will experience opportunities to use many of your skills and expand your knowledge\nOngoing opportunities for continuing education, training and professional development\nTotal Rewards program which includes group benefits, and pension plan\nEducation bursaries\nExtensive paid orientation and preceptorship program\nSubsidized RPNAO memberships\nTuition Assistance Program\nREQUIREMENTS:\nAvailability to work days, evenings and every other weekend.\nA willingness to attain required Saint Elizabeth certifications.\nStrong computer skills in MS Word, MS Excel, Email etc.\nAble to work independently as well as part of a team.\nWell-developed interpersonal skills.\nExcellent organizational skills.\nEffective problem-solving and conflict management skills.\nWorks well in a changing environment.\nA demonstrated appreciation for Quality Improvement processes.\nCurrent Certificate of Competence with the College of Nurses of Ontario.\nA current CPR certificate is required.\nA valid driver’s license and vehicle.\nThis is a physically demanding position and requires sitting, standing, walking, bending, kneeling/squatting, reaching at chest and waist level (i.e. shoulder flexion) and numerous hand grips of varying forces.\nSaint Elizabeth is committed to the success of all its employees. If you feel you need accommodations because of illness or disability, please do not hesitate to contact Human Resources at hresources@saintelizabeth.com at your earliest convenience. You will also be briefed on the Company’s policies, including its policies regarding human rights, accommodation and the Accessibility for Ontarians with Disabilities Act (“AODA”) during your orientation process.",
  "type": "",
  "sectors": ["Healthcare"],
  "skills": [".com", "AOD", "AODA", "Access", "Accessibility", "Assistance", "Availability", "Canada", "Canadian", "Career", "College", "Colleges", "Comp", "Company", "Disabilities", "EME", "ENT", "Education", "Email", "Excel", "Excellence", "Excellent", "Ext", "Foundation", "Health", "Human Resources", "Improvement", "Nurses", "Ongoing", "Ontario", "PNA", "Practical", "Pro", "Quality Improvement", "REM", "Register", "Registered", "Res", "Research", "Resources", "Reward", "Rewards", "Strong", "Subs", "Total Reward", "Total Rewards", "Tuition", "Word"],
  "similarity": 6.888888888888889
}, {
  "title": "Full Time Staff Pharmacist - #1041, Napanee, ON",
  "company": "WalMart – Napanee",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1724&ao=133042&s=58&guid=00000163a84da015a4690709241d7b75&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_0e7be207&cb=1527537050070&jobListingId=2787546333",
  "img": "https://media.glassdoor.com/sqlm/715/walmart-squarelogo-1522958070210.png",
  "description": "Job Title\nFull Time Staff Pharmacist - #1041, Napanee, ON\n\n22-May-2018\n\nReq ID\n1063732BR\n\nCompany Summary\nWalmart Canada operates a growing chain of more than 400 stores nationwide serving more than 1.2 million customers each day. Walmart Canada’s flagship online store, www.walmart.ca, is visited by 600,000 customers daily. With more than 85,000 associates, Walmart Canada is one of Canada’s largest employers and is ranked one of the country’s top 10 most influential brands. Walmart Canada’s extensive philanthropy program is focused on supporting Canadian families in need, and since 1994 Walmart has donated and raised more than $300 million to Canadian charities. Additional information can be found at walmartcanada.ca, facebook.com/walmartcanada and at twitter.com/@walmartcanada\n\nPosition Summary\nThe Pharmacist assists the Pharmacy Manager in all aspects of Pharmacy Operations.\n\nPosition Responsibilities\nAn individual must be able to successfully perform the essential functions of this position with or without a reasonable accommodation. • Administer, support and represent the core corporate values of Respect for the Individual, Service to our Customer and Striving for Excellence. • Maintain patient confidentiality and follow all practices consistent with the Privacy Act. • Maintain a high level of customer service and patient care in the Pharmacy. o Greeting and thanking every Customer, o Locating merchandise on the sales floor, o Advising customers on the selection of medication brands, medical equipment and health-care supplies. o Offering health promotion and prevention activities, for example, training people to use devices such as blood pressure or diabetes monitors. • Establish and develop a strong working relationship with Division Management and Professional Services District Manager. • Manage workflow in the dispensary. • Accept prescriptions or refill requests from Customers, Doctors or Hospitals. • Ensure all prescriptions are filled accurately, efficiently and safely. • Provide information and advice regarding administration, usage, drug interactions, side effects, dosage and proper medication storage. • Maintain customer medication profiles and records, including but not limited to pharmacy files, patient profiles, charge system files, inventories, etc. • Ensure proper storage of pharmaceutical products. • Review records and reports to determine compliance with Company operational expectations. • Operate Pharmacy computer, register equipment and other assigned tools. • Protecting company assets.\n\nQualifications\nCompetencies An individual must be proficient in each of the competencies listed below to successfully perform the responsibilities of this position. Customer/Patient Centered: Actively strives to provide excellent customer service. Seeks to meet customer needs and demands. Remains calm and professional. Reviews inquiries from internal/external customers and takes action to remedy the situation. Energy: The internal drive to be active and get things done; to have sustained energy to accomplish work tasks. This includes the ability to work vigorously toward a goal or objective and to work wholeheartedly with constant determination. Initiative: Being willing to take action on self-identified job responsibilities and challenges. Refers to the degree to which one jumps into action and seeks out challenges without waiting to be told. It refers to the tendency to be proactive and act versus doing only what one is told to do. Leadership: A willingness to lead, take charge, and offer opinions and direction. It refers to the degree to which one is assertive, persuasive, enthusiastic, and willing to take charge. It refers to the ability to commit to inspire others to action and to pursue team goals with vigour and urgency. Optimism: Having a predisposition to experience positive states, such as joy and happiness and the expectation that one will experience good outcomes in life. Judgment: The degree to which one is able to analyze typical business problems and determine appropriate courses of action. It refers to “street smarts,” or what is often called “common sense,” and to the ability to differentiate between effective and ineffective solutions to common problems. Critical Thinking: It refers to the ability to analyze problems, integrate information from a variety of sources, and to think problems through critically, looking at all possibilities. Mathematical Skills: Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions and decimals. Basic Reading Skills: Ability to understand the meaning of written or printed matter and to record information by inscribing characters or symbols. Verbal Communication Skills: Ability to communicate effectively to maximize accuracy in the delivery of patient care.\n\nLicensing & Other Qualifications\nCertificates, Licenses, and Registrations • Completion of a Bachelor of Science Degree in Pharmacy. • Licensed by the relevant Provincial College of Pharmacists.\n\nEmployment Type\nFull Time\n\nCanada Walmart Division\nPharmacy\n\nStore Location\n89 JIM KIMMETT BLVD. , NAPANEE, ON, K7R 3L1\n\nProvince\nOntario\n\nCanadian Cities\nNapanee\n\nAccessibility\nWalmart will accommodate the disability-related needs of applicants and associates as required by law.",
  "type": "Full Time",
  "sectors": [],
  "skills": [".com", "APA", "Ability", "Access", "Accessibility", "Active", "Addition", "Admin", "Administer", "Canada", "Canadian", "College", "Comm", "Communication", "Communication Skills", "Comp", "Company", "Completion", "Crit", "Critical", "Critical Thinking", "Custom", "Customer", "District", "Division", "Division Management", "Doctors", "Employment", "Energy", "Excel", "Excellence", "Full", "Greeting", "Hospitals", "Individual", "Job", "Judgment", "LVD", "Leadership", "Licensing", "Locating", "Location", "Maintain", "Management", "Mathematica", "NAP", "Offer", "Offering", "Ontario", "Ope", "Opera", "Operate", "Operation", "Operations", "Other", "PAN", "Patient", "Pharm", "Pharmacists", "Pharmacy", "Privacy Act", "Pro", "Profession", "Professional", "Professional Services", "Protect", "Protecting", "Provide", "Provincial", "Qualification", "Reading", "Registration", "Registrations", "Res", "Respect", "Review", "Reviews", "Science", "Services", "Ski", "Skills", "Store", "Striving for Excellence", "Sum", "Thin", "Thinking", "Time", "Type", "Wit"],
  "similarity": 6.7272727272727275
}, {
  "title": "Residential HVAC Installer",
  "company": "Service Experts – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=908&ao=4120&s=58&guid=00000163a84158ef8f60c0ddcd7f4994&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_62289c24&cb=1527536245255&jobListingId=2728088931",
  "img": "https://media.glassdoor.com/sqlm/6308/service-experts-squarelogo-1416595592873.png",
  "description": "At Service Experts Heating & Air Conditioning we believe in doing what’s right for our customers and our employees. We offer the stability of working for a national industry leader but we also treat our people like family. Our team is made up of the very best, and we provide ongoing training, support, and opportunities for unlimited professional growth.\n\nResidential HVAC Installer\n\nAs a member of our team, you will install heating, air conditioning, ventilation, and refrigeration equipment as well as accessories. Previous residential installation experience is required with a strong focus on customer service and a commitment to integrity.\n\nThe qualified candidate must have a high school diploma or equivalent, experience in the residential installation field, good communication skills, and mechanical aptitude. A license in plumbing, electrical work, sheet metal, or refrigeration is preferred. Applicants must be able to read and interpret drawings, blueprints, and production diagrams. Team work is a priority and installers must be willing to work with and assist co-workers as needed, in addition to working overtime, night, and weekend hours.\n\nAll employees must be able to pass our criminal background check and driving record check.\n\nWe are proud to offer competitive benefits which include medical benefits, dental benefits, short-term and long-term disability benefits, world-class training, and long-term career opportunities.\n\nJoin the team of Experts and realize your full potential.\n\nService Experts is an Equal Opportunity Employer.\n\nService Experts is committed to an inclusive, barrier-free recruitment process. We will accommodate the needs of applicants under the Ontario Human Rights Code and the Accessibility for Ontarians with Disabilities Act (AODA) throughout the recruitment process. If you require an accommodation, please contact the Human Resources Department and we will work with you to meet your needs.",
  "type": "",
  "sectors": ["Construction"],
  "skills": ["AOD", "AODA", "Access", "Accessibility", "Air", "Air Conditioning", "App", "Code", "Condition", "Department", "Disabilities", "Exp", "Expert", "HVAC", "Heat", "Heating", "Human Resources", "Human Rights", "Install", "Ontario", "Res", "Resources", "Rig", "Rights", "Tea", "Team"],
  "similarity": 6.666666666666667
}, {
  "title": "Manager - Pharmacy,Operations Sys & Int.",
  "company": "Kingston General Hospital – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=710&ao=4127&s=58&guid=00000163a83e7c129331f2e2d3aa3b55&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_18341ebd&cb=1527536057872&jobListingId=2776241704",
  "img": "https://media.glassdoor.com/sqlm/101113/kingston-general-hospital-squarelogo.png",
  "description": "Applications will be accepted until 11:59 pm on 2018 May 18\n\nTitle: Pharmacy Manager- Operations, Systems and Integration\n\nDepartment: Pharmacy Administration\n\nPosition Number: 50060507\n\nHours of Work: Temporary, Full-Time Position; Days (1 year)\n\nSalary: MSIV ($95,155.32 – 116,300.93 per annum)\n\nUnion: Non-Union\n\nLocation: Kingston General Hospital Site\n\nDESCRIPTION\nUnder the supervision of the Director of Pharmacy Services, the Pharmacy Manager, Operations, Systems and Integration:\n\nManages the Hospital drug distribution system in accordance with the National Association of Pharmacy Under the supervision of the Director of Pharmacy Services, the Pharmacy Manager, Operations, Systems and Integration:\nManages the KHSC and BGH Hospital drug distribution system in accordance with the National Association of Pharmacy Regulatory Authorities (NAPRA) Model Standards of Practice for Canadian Pharmacists, the Ontario College of Pharmacists Practice standards, the Hospital Administrative policies for managing pharmaceuticals and the standard operating procedures of the Department of Pharmacy Services.\nManages the KHSC Pharmacy technicians with support from the KHSC Pharmacy Supervisor, Drug Distribution, including hiring, training, scheduling and performance management.\nManages the BGH pharmacists and Pharmacy technicians with support from the BGH Pharmacy Supervisor, Drug Distribution, including hiring, training, scheduling and performance management.\nUnderstands and is familiar with all pertinent KHSC and BGH policies and procedures including those relating to workplace conduct. Complies with the KHSC and BGH Commitment to uphold the Workplace Conduct and Reporting of Inappropriate Conduct policy and behaves in a manner that is consistent with the guiding principles and expectations.\nPRIMARY RESPONSIBILITES & DUTIES:\nResponsible for the delivery of quality drug distribution services in the KHSC and BGH Hospitals including effective planning and utilization of staff, pharmacy information systems, equipment and drug supplies.\nActs as the designated manager, in compliance with the Ontario College of Pharmacists policy, for medication procurement, inventory management, drug dispensing and professional supervision of the Hospital main dispensary (KGH site and BGH).\nManages the Pharmacy Supervisors, Drug Distribution and the Senior Pharmacy technicians.\nManages the Pharmacy technicians with support from the Pharmacy Supervisors, Drug Distribution.\nManages the pharmacists ensuring BGH clinical pharmacy programs are in alignment with the direction of the KHSC Pharmacy Manager, Clinical Practice\nResponsible for drug compounding (sterile and non-sterile, non-hazardous) in compliance with the NAPRA standards.\nDevelops and revises standard operating procedures for all activities related to the procurement, storage, packaging, preparation, compounding and dispensing of drugs in compliance with the Ontario College of Pharmacists inspection criteria and Canadian Hospital Pharmacy professional and accreditation standards\nCoordinates the purchase and maintenance of Pharmacy equipment and systems.\nManages drug and equipment recalls, backorders, and shortages.\nReports controlled drug losses to Health Canada\nSupports customers (internal departments and Programs and external partner hospitals and organizations) with sourcing of drugs and dispensing.\nResponsible for the management and monitoring of the Hospital drug inventory.\nAdhere to the Fiscal Hospital budget allocated to the Pharmacy Drug Distribution cost center.\nContributes to optimization of the corporate drug budget by reducing drug wastage and expired drugs.\nResponsible for workload and activity reporting to the Ministry of Health and Long Term Care including statistics on volume and type of activities related to drug distribution.\nParticipates in the Pharmacy Departments’ annual tactics and strategic goals in alignment with the Hospital strategic plan.\nDevelops and tracks outcome indicators to assess the quality and safety of the drug distribution system\nDevelops annual strategic goals and objectives, and continuously strive to improve the Hospitals drug distribution system.\nManages the planning and implementation of new equipment, technology, automation or processes related to improvement in the drug distribution system.\nActively participates in the activities of the Hospital Medication Safety Committees.\n*NOTE: The above duties are representative but are not to be construed as all-inclusive.\n\nQUALIFICATIONS:\nBachelor of Science in Pharmacy or Doctorate of Pharmacy (PharmD)\nRegistration as a Pharmacist with the Ontario College of Pharmacists (Part A)\nMinimum of five years hospital pharmacy experience.\nPharmacy residency certificate in hospital pharmacy practice preferred\nDemonstrated excellence in:\nverbal and written communication\nteaching and mentoring\nmotivation and leadership skills\norganizing and managing teams\ninterviewing and counseling\nproject management\nproblem analysis and solving skills\ncomputer skills (MS Office)\nKnowledge of Pharmacy Systems (BDM, Omnicell, FastPak EXP) preferred.\nKnowledge of Report writing software (JasperSoft, Foxfire!) preferred.\nDemonstrated ability to attend work on a regular basis\nSatisfactory criminal reference check required.\nPHYSICAL REQUIREMENTS:\n\nThe applicant must be able to meet the physical demands of this position.",
  "type": "Full Time",
  "sectors": ["Management"],
  "skills": ["Active", "Acts", "Admin", "Administration", "Administrative", "App", "Application", "Applications", "Association", "Author", "BDM", "CAT", "Canada", "Canadian", "College", "Comm", "Committees", "Comp", "Cont", "Contribute", "Coordinate", "DES", "Department", "Departments", "Develops", "Direct", "Director", "Distribution", "Drug Distribution", "EME", "ENT", "ESP", "FICA", "Fast", "Fox", "Full", "Gen", "General", "Health", "Hospital Pharmacy", "Hospitals", "Hour", "Hours", "ICA", "IMA", "IPT", "Int", "Integration", "Jasper", "LIF", "Location", "Long Term", "MAR", "Manages", "NAP", "NSI", "National", "ONS", "Office", "Omnicell", "Ontario", "Ope", "Opera", "Operation", "Operations", "PHY", "PON", "PRA", "Part", "Pharm", "Pharmacists", "Pharmacy", "Pro", "REM", "RESP", "RIM", "RIP", "Registration", "Regulatory", "Reporting", "Reports", "Res", "Responsible", "SCR", "SIC", "SIV", "Safe", "Safety", "Safety Committee", "Salary", "Science", "Services", "Stand", "Supports", "Syst", "System", "Systems", "TES", "Tempo", "Time", "Union"],
  "similarity": 6.615384615384615
}, {
  "title": "Cook - Kingsdale Chateau",
  "company": "Atria Retirement Canada – Kingston",
  "url": "https://www.glassdoor.ca/partner/jobListing.htm?pos=1617&ao=4008&s=58&guid=00000163a84c23aa8d3f01ea9b2036e5&src=GD_JOB_AD&t=SR&extid=1&exst=L&ist=&ast=L&vt=w&slr=true&rtp=0&cs=1_d78210a6&cb=1527536952552&jobListingId=2529706545",
  "img": "https://media.glassdoor.com/sqlm/1173358/atria-retirement-canada-squarelogo-1495795769109.png",
  "description": "Overview\n\nAtria Senior Living is a leading operator of independent living, assisted living, supportive living, and memory care communities in 190 locations in 27 states and seven Canadian provinces. We are the residence of choice for more than 21,000 seniors, and the workplace of choice for more than 14,600 employees. We create vibrant communities where older adults can thrive and participate, know that their contributions are valued, and enjoy access to opportunities and support that help them continue making a difference in our world.\n\nAtria is an equal opportunity employer. Atria provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, age, national origin, disability, veteran status, or any other classification protected by applicable law. Atria also does not condone or tolerate an atmosphere of intimidation or harassment based on these protected classifications. We require the cooperation of all employees in maintaining a discrimination-free and harassment-free work environment.\n\nResponsibilities\n\nResponsible for the preparation and cooking of food in the community. Ensure that all meals are prepared and presented according to Atria standards.\nProvide a high level of culinary customer service and promote a restaurant style dining atmosphere.\nWork closely with the Director of Culinary Services and/or Executive Director to keep residents satisfied with food and dining programs.\nAssist with the preparation and execution of the Art of Atria Dining enhancement programs.\nMaintain kitchen and food storage and preparation areas in a clean, safe, and sanitary condition at all times.\nResponsible for the opening and/or closing of the kitchen.\nAdhere to cleaning schedules as assigned.\nEnsures that all food is received, stored, and prepared according to Company standards.\nEstimate daily or weekly needs of food and supplies and communicates needs to Director of Culinary Services or assistant Director of Culinary Services.\nParticipate in preparing and cooking meals according to established recipes and approved menus.\nDocument temperatures of food prior to service, refrigeration and freezer.\nPrepare and ensure snacks and beverages are available to residents at all times.\nKeep kitchen floors clean (sweeps and mops) and trash emptied.\nAssist with the transportation and storage of food and supplies.\nAdhere to Quality Enhancement standards and standard food safety practices.\nAssist with preparation and execution of special events, banquets, and theme meals.\nWill attend pre-meal stand up in kitchen prior to meal service.\nMay perform other duties as needed and/or assigned.\nQualifications\nHigh School Diploma or General Education Degree (GED).\nMinimum of one (1) to three (3) years of experience as a cook in a hospitality or healthcare environment.\nFood handlers permit as required by state law and/or Company standards.\nAble to read and follow recipes and printed production guides, cleaning schedules, and logs.\nCook, prep cook, line cook, kitchen help, kitchen, banquet, culinary, hotel, hospitality, country club, resort, food service, food",
  "type": "",
  "sectors": ["Restaurant"],
  "skills": ["Art", "Canadian", "Chat", "Comp", "Company", "Direct", "Director", "Education", "Estimate", "Food", "GED", "Gen", "General", "High", "Living", "Maintain", "Part", "Pro", "Provide", "Qualification", "Res", "Responsible", "Senior Living", "Services"],
  "similarity": 6.571428571428571
}]
